In [1]:
import pandas as pd
df_employees = pd.read_csv('Employees.csv')
df_employees.head(5)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,1990-01-03,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,1991-05-21,IT_PROG,6000,NaN,103.0,60.0

In [2]:
df_employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   employee_id     107 non-null    int64
 1   first_name      107 non-null    object
 2   last_name       107 non-null    object
 3   email           107 non-null    object
 4   phone_number    107 non-null    object
 5   hire_date       107 non-null    object
 6   job_id          107 non-null    object
 7   salary          107 non-null    int64
 8   commission_pct  35 non-null     float64
 9   manager_id      106 non-null    float64
 10  department_id   106 non-null    float64
dtypes: float64(3), int64(2), object(6)
memory usage: 9.3+ KB

In [8]:
import sqlalchemy
from sqlalchemy import create_engine
engine = create_engine('postgresql://challenge:challenge@localhost:5432/40_days')
engine.connect()
print(pd.io.sql.get_schema(df_employees,'Employees', con = engine))

CREATE TABLE "Employees" (
	employee_id BIGINT,
	first_name TEXT,
	last_name TEXT,
	email TEXT,
	phone_number TEXT,
	hire_date TEXT,
	job_id TEXT,
	salary BIGINT,
	commission_pct FLOAT(53),
	manager_id FLOAT(53),
	department_id FLOAT(53)
)

In [9]:
df_employees.hire_date = pd.to_datetime(df_employees.hire_date)

In [10]:
print(pd.io.sql.get_schema(df_employees,'Employees', con = engine))

CREATE TABLE "Employees" (
	employee_id BIGINT,
	first_name TEXT,
	last_name TEXT,
	email TEXT,
	phone_number TEXT,
	hire_date TIMESTAMP WITHOUT TIME ZONE,
	job_id TEXT,
	salary BIGINT,
	commission_pct FLOAT(53),
	manager_id FLOAT(53),
	department_id FLOAT(53)
)

In [13]:
print(len(df_employees.index))

107

In [14]:
print(pd.io.sql.get_schema(df_employees,'Employees'))

CREATE TABLE "Employees" (
"employee_id" INTEGER,
  "first_name" TEXT,
  "last_name" TEXT,
  "email" TEXT,
  "phone_number" TEXT,
  "hire_date" TIMESTAMP,
  "job_id" TEXT,
  "salary" INTEGER,
  "commission_pct" REAL,
  "manager_id" REAL,
  "department_id" REAL
)

In [15]:
len(df_employees)

107

In [16]:
df_employees.to_sql('employees', con=engine, if_exists = 'replace')

107